wojtek327/-49-_stm32_bmi160_spi/stm32_bmi160_defines.h
#define BMI160_RA_STEP_CNT_L        0x78
#define BMI160_RA_STEP_CNT_H        0x79

#define BMI160_STEP_BUF_MIN_BIT     0
#define BMI160_STEP_BUF_MIN_LEN     3
#define BMI160_STEP_CNT_EN_BIT      3

#define BMI160_STEP_TIME_MIN_BIT    0
#define BMI160_STEP_TIME_MIN_LEN    3
#define BMI160_STEP_THRESH_MIN_BIT  3
#define BMI160_STEP_THRESH_MIN_LEN  2
#define BMI160_STEP_ALPHA_BIT       5
#define BMI160_STEP_ALPHA_LEN       3

#define BMI160_RA_STEP_CONF_0       0x7A
#define BMI160_RA_STEP_CONF_1       0x7B

#define BMI160_RA_STEP_CONF_0_NOR   0x15
#define BMI160_RA_STEP_CONF_0_SEN   0x2D
#define BMI160_RA_STEP_CONF_0_ROB   0x1D
#define BMI160_RA_STEP_CONF_1_NOR   0x03
#define BMI160_RA_STEP_CONF_1_SEN   0x00
#define BMI160_RA_STEP_CONF_1_ROB   0x07


#define BMI160_GYRO_RANGE_SEL_BIT   0
#define BMI160_GYRO_RANGE_SEL_LEN   3

#define BMI160_GYRO_RATE_SEL_BIT    0
#define BMI160_GYRO_RATE_SEL_LEN    4

#define BMI160_GYRO_DLPF_SEL_BIT    4
#define BMI160_GYRO_DLPF_SEL_LEN    2

#define BMI160_ACCEL_DLPF_SEL_BIT   4
#define BMI160_ACCEL_DLPF_SEL_LEN   3

#define BMI160_ACCEL_RANGE_SEL_BIT  0
#define BMI160_ACCEL_RANGE_SEL_LEN  4

#define BMI160_CMD_START_FOC        0x03
#define BMI160_CMD_ACC_MODE_NORMAL  0x11
#define BMI160_CMD_GYR_MODE_NORMAL  0x15
#define BMI160_CMD_FIFO_FLUSH       0xB0
#define BMI160_CMD_INT_RESET        0xB1
#define BMI160_CMD_STEP_CNT_CLR     0xB2
#define BMI160_CMD_SOFT_RESET       0xB6

#define BMI160_RA_CMD               0x7E

#define BMI160_ACCEL_BW_MASK                      (0x70)
#define BMI160_ACCEL_ODR_MASK                     (0x0F)
#define BMI160_ACCEL_UNDERSAMPLING_MASK           (0x80)
#define BMI160_ACCEL_RANGE_MASK                   (0x0F)
#define BMI160_GYRO_BW_MASK                       (0x30)
#define BMI160_GYRO_ODR_MASK                      (0x0F)
#define BMI160_GYRO_RANGE_MASK                    (0x07)

#define BMI160_ACCEL_BW_POS                       (4)
#define BMI160_GYRO_BW_POS                        (4)

/** Mask definitions for INT_EN registers */
#define BMI160_ANY_MOTION_X_INT_EN_MASK           (0x01)
#define BMI160_HIGH_G_X_INT_EN_MASK               (0x01)
#define BMI160_NO_MOTION_X_INT_EN_MASK            (0x01)
#define BMI160_ANY_MOTION_Y_INT_EN_MASK           (0x02)
#define BMI160_HIGH_G_Y_INT_EN_MASK               (0x02)
#define BMI160_NO_MOTION_Y_INT_EN_MASK            (0x02)
#define BMI160_ANY_MOTION_Z_INT_EN_MASK           (0x04)
#define BMI160_HIGH_G_Z_INT_EN_MASK               (0x04)
#define BMI160_NO_MOTION_Z_INT_EN_MASK            (0x04)
#define BMI160_SIG_MOTION_INT_EN_MASK             (0x07)
#define BMI160_ANY_MOTION_ALL_INT_EN_MASK         (0x07)
#define BMI160_STEP_DETECT_INT_EN_MASK            (0x08)
#define BMI160_DOUBLE_TAP_INT_EN_MASK             (0x10)
#define BMI160_SINGLE_TAP_INT_EN_MASK             (0x20)
#define BMI160_FIFO_FULL_INT_EN_MASK              (0x20)
#define BMI160_ORIENT_INT_EN_MASK                 (0x40)
#define BMI160_FIFO_WATERMARK_INT_EN_MASK         (0x40)
#define BMI160_LOW_G_INT_EN_MASK                  (0x08)
#define BMI160_STEP_DETECT_EN_MASK                (0x08)
#define BMI160_FLAT_INT_EN_MASK                   (0x80)
#define BMI160_DATA_RDY_INT_EN_MASK               (0x10)

/** PMU status Macros */
#define BMI160_AUX_PMU_SUSPEND                    (0x00)
#define BMI160_AUX_PMU_NORMAL                     (0x01)
#define BMI160_AUX_PMU_LOW_POWER                  (0x02)

#define BMI160_GYRO_PMU_SUSPEND                   (0x00)
#define BMI160_GYRO_PMU_NORMAL                    (0x01)
#define BMI160_GYRO_PMU_FSU                       (0x03)

#define BMI160_ACCEL_PMU_SUSPEND                  (0x00)
#define BMI160_ACCEL_PMU_NORMAL                   (0x01)
#define BMI160_ACCEL_PMU_LOW_POWER                (0x02)

/** Mask definitions for INT_OUT_CTRL register */
#define BMI160_INT1_EDGE_CTRL_MASK                (0x01)
#define BMI160_INT1_OUTPUT_MODE_MASK              (0x04)
#define BMI160_INT1_OUTPUT_TYPE_MASK              (0x02)
#define BMI160_INT1_OUTPUT_EN_MASK                (0x08)
#define BMI160_INT2_EDGE_CTRL_MASK                (0x10)
#define BMI160_INT2_OUTPUT_MODE_MASK              (0x40)
#define BMI160_INT2_OUTPUT_TYPE_MASK              (0x20)
#define BMI160_INT2_OUTPUT_EN_MASK                (0x80)

/** Mask definitions for INT_LATCH register */
#define BMI160_INT1_INPUT_EN_MASK                 (0x10)
#define BMI160_INT2_INPUT_EN_MASK                 (0x20)
#define BMI160_INT_LATCH_MASK                     (0x0F)

/** Mask definitions for INT_MAP register */
#define BMI160_INT1_LOW_G_MASK                    (0x01)
#define BMI160_INT1_HIGH_G_MASK                   (0x02)
#define BMI160_INT1_SLOPE_MASK                    (0x04)
#define BMI160_INT1_NO_MOTION_MASK                (0x08)
#define BMI160_INT1_DOUBLE_TAP_MASK               (0x10)
#define BMI160_INT1_SINGLE_TAP_MASK               (0x20)
#define BMI160_INT1_FIFO_FULL_MASK                (0x20)
#define BMI160_INT1_FIFO_WM_MASK                  (0x40)
#define BMI160_INT1_ORIENT_MASK                   (0x40)
#define BMI160_INT1_FLAT_MASK                     (0x80)
#define BMI160_INT1_DATA_READY_MASK               (0x80)
#define BMI160_INT2_LOW_G_MASK                    (0x01)
#define BMI160_INT1_LOW_STEP_DETECT_MASK          (0x01)
#define BMI160_INT2_LOW_STEP_DETECT_MASK          (0x01)
#define BMI160_INT2_HIGH_G_MASK                   (0x02)
#define BMI160_INT2_FIFO_FULL_MASK                (0x02)
#define BMI160_INT2_FIFO_WM_MASK                  (0x04)
#define BMI160_INT2_SLOPE_MASK                    (0x04)
#define BMI160_INT2_DATA_READY_MASK               (0x08)
#define BMI160_INT2_NO_MOTION_MASK                (0x08)
#define BMI160_INT2_DOUBLE_TAP_MASK               (0x10)
#define BMI160_INT2_SINGLE_TAP_MASK               (0x20)
#define BMI160_INT2_ORIENT_MASK                   (0x40)
#define BMI160_INT2_FLAT_MASK                     (0x80)

/** Mask definitions for INT_DATA register */
#define BMI160_TAP_SRC_INT_MASK                   (0x08)
#define BMI160_LOW_HIGH_SRC_INT_MASK              (0x80)
#define BMI160_MOTION_SRC_INT_MASK                (0x80)

