wojtek327/-49-_stm32_bmi160_spi/stm32_bmi160_defines.h
/** Mask definitions for INT_MOTION register */
#define BMI160_SLOPE_INT_DUR_MASK                 (0x03)
#define BMI160_NO_MOTION_INT_DUR_MASK             (0xFC)
#define BMI160_NO_MOTION_SEL_BIT_MASK             (0x01)

/** Mask definitions for INT_TAP register */
#define BMI160_TAP_DUR_MASK                       (0x07)
#define BMI160_TAP_SHOCK_DUR_MASK                 (0x40)
#define BMI160_TAP_QUIET_DUR_MASK                 (0x80)
#define BMI160_TAP_THRES_MASK                     (0x1F)

/** Mask definitions for INT_FLAT register */
#define BMI160_FLAT_THRES_MASK                    (0x3F)
#define BMI160_FLAT_HOLD_TIME_MASK                (0x30)
#define BMI160_FLAT_HYST_MASK                     (0x07)

/** Mask definitions for INT_LOWHIGH register */
#define BMI160_LOW_G_HYST_MASK                    (0x03)
#define BMI160_LOW_G_LOW_MODE_MASK                (0x04)
#define BMI160_HIGH_G_HYST_MASK                   (0xC0)

/** Mask definitions for INT_SIG_MOTION register */
#define BMI160_SIG_MOTION_SEL_MASK                (0x02)
#define BMI160_SIG_MOTION_SKIP_MASK               (0x0C)
#define BMI160_SIG_MOTION_PROOF_MASK              (0x30)

/** Mask definitions for INT_ORIENT register */
#define BMI160_ORIENT_MODE_MASK                   (0x03)
#define BMI160_ORIENT_BLOCK_MASK                  (0x0C)
#define BMI160_ORIENT_HYST_MASK                   (0xF0)
#define BMI160_ORIENT_THETA_MASK                  (0x3F)
#define BMI160_ORIENT_UD_ENABLE                   (0x40)
#define BMI160_AXES_EN_MASK                       (0x80)

/** Mask definitions for FIFO_CONFIG register */
#define BMI160_FIFO_GYRO                          (0x80)
#define BMI160_FIFO_ACCEL                         (0x40)
#define BMI160_FIFO_AUX                           (0x20)
#define BMI160_FIFO_TAG_INT1                      (0x08)
#define BMI160_FIFO_TAG_INT2                      (0x04)
#define BMI160_FIFO_TIME                          (0x02)
#define BMI160_FIFO_HEADER                        (0x10)
#define BMI160_FIFO_CONFIG_1_MASK                 (0xFE)

/** Mask definitions for STEP_CONF register */
#define BMI160_STEP_COUNT_EN_BIT_MASK             (0x08)
#define BMI160_STEP_DETECT_MIN_THRES_MASK         (0x18)
#define BMI160_STEP_DETECT_STEPTIME_MIN_MASK      (0x07)
#define BMI160_STEP_MIN_BUF_MASK                  (0x07)

/** Mask definition for FIFO Header Data Tag */
#define BMI160_FIFO_TAG_INTR_MASK                 (0xFC)

/** Fifo byte counter mask definitions */
#define BMI160_FIFO_BYTE_COUNTER_MASK             (0x07)

/** Enable/disable bit value */
#define BMI160_ENABLE                             (0x01)
#define BMI160_DISABLE                            (0x00)

/** Latch Duration */
#define BMI160_LATCH_DUR_NONE                     (0x00)
#define BMI160_LATCH_DUR_312_5_MICRO_SEC          (0x01)
#define BMI160_LATCH_DUR_625_MICRO_SEC            (0x02)
#define BMI160_LATCH_DUR_1_25_MILLI_SEC           (0x03)
#define BMI160_LATCH_DUR_2_5_MILLI_SEC            (0x04)
#define BMI160_LATCH_DUR_5_MILLI_SEC              (0x05)
#define BMI160_LATCH_DUR_10_MILLI_SEC             (0x06)
#define BMI160_LATCH_DUR_20_MILLI_SEC             (0x07)
#define BMI160_LATCH_DUR_40_MILLI_SEC             (0x08)
#define BMI160_LATCH_DUR_80_MILLI_SEC             (0x09)
#define BMI160_LATCH_DUR_160_MILLI_SEC            (0x0A)
#define BMI160_LATCH_DUR_320_MILLI_SEC            (0x0B)
#define BMI160_LATCH_DUR_640_MILLI_SEC            (0x0C)
#define BMI160_LATCH_DUR_1_28_SEC                 (0x0D)
#define BMI160_LATCH_DUR_2_56_SEC                 (0x0E)
#define BMI160_LATCHED                            (0x0F)

/** BMI160 Register map */
#define BMI160_CHIP_ID_ADDR                       (0x00)
#define BMI160_ERROR_REG_ADDR                     (0x02)
#define BMI160_PMU_STATUS_ADDR                    (0x03)
#define BMI160_AUX_DATA_ADDR                      (0x04)
#define BMI160_GYRO_DATA_ADDR                     (0x0C)
#define BMI160_ACCEL_DATA_ADDR                    (0x12)
#define BMI160_STATUS_ADDR                        (0x1B)
#define BMI160_INT_STATUS_ADDR                    (0x1C)
#define BMI160_FIFO_LENGTH_ADDR                   (0x22)
#define BMI160_FIFO_DATA_ADDR                     (0x24)
#define BMI160_ACCEL_CONFIG_ADDR                  (0x40)
#define BMI160_ACCEL_RANGE_ADDR                   (0x41)
#define BMI160_GYRO_CONFIG_ADDR                   (0x42)
#define BMI160_GYRO_RANGE_ADDR                    (0x43)
#define BMI160_AUX_ODR_ADDR                       (0x44)
#define BMI160_FIFO_DOWN_ADDR                     (0x45)
#define BMI160_FIFO_CONFIG_0_ADDR                 (0x46)
#define BMI160_FIFO_CONFIG_1_ADDR                 (0x47)
#define BMI160_AUX_IF_0_ADDR                      (0x4B)
#define BMI160_AUX_IF_1_ADDR                      (0x4C)
#define BMI160_AUX_IF_2_ADDR                      (0x4D)
#define BMI160_AUX_IF_3_ADDR                      (0x4E)
#define BMI160_AUX_IF_4_ADDR                      (0x4F)
#define BMI160_INT_ENABLE_0_ADDR                  (0x50)
#define BMI160_INT_ENABLE_1_ADDR                  (0x51)
#define BMI160_INT_ENABLE_2_ADDR                  (0x52)
#define BMI160_INT_OUT_CTRL_ADDR                  (0x53)
#define BMI160_INT_LATCH_ADDR                     (0x54)
#define BMI160_INT_MAP_0_ADDR                     (0x55)
#define BMI160_INT_MAP_1_ADDR                     (0x56)
#define BMI160_INT_MAP_2_ADDR                     (0x57)
#define BMI160_INT_DATA_0_ADDR                    (0x58)
#define BMI160_INT_DATA_1_ADDR                    (0x59)
#define BMI160_INT_LOWHIGH_0_ADDR                 (0x5A)
#define BMI160_INT_LOWHIGH_1_ADDR                 (0x5B)
#define BMI160_INT_LOWHIGH_2_ADDR                 (0x5C)
#define BMI160_INT_LOWHIGH_3_ADDR                 (0x5D)
#define BMI160_INT_LOWHIGH_4_ADDR                 (0x5E)
#define BMI160_INT_MOTION_0_ADDR                  (0x5F)
#define BMI160_INT_MOTION_1_ADDR                  (0x60)
#define BMI160_INT_MOTION_2_ADDR                  (0x61)
#define BMI160_INT_MOTION_3_ADDR                  (0x62)
#define BMI160_INT_TAP_0_ADDR                     (0x63)
#define BMI160_INT_TAP_1_ADDR                     (0x64)
#define BMI160_INT_ORIENT_0_ADDR                  (0x65)
#define BMI160_INT_ORIENT_1_ADDR                  (0x66)
#define BMI160_INT_FLAT_0_ADDR                    (0x67)
#define BMI160_INT_FLAT_1_ADDR                    (0x68)
#define BMI160_FOC_CONF_ADDR                      (0x69)
#define BMI160_CONF_ADDR                          (0x6A)

#define BMI160_IF_CONF_ADDR                       (0x6B)
#define BMI160_SELF_TEST_ADDR                     (0x6D)
#define BMI160_OFFSET_ADDR                        (0x71)
#define BMI160_OFFSET_CONF_ADDR                   (0x77)
#define BMI160_INT_STEP_CNT_0_ADDR                (0x78)
#define BMI160_INT_STEP_CONFIG_0_ADDR             (0x7A)
#define BMI160_INT_STEP_CONFIG_1_ADDR             (0x7B)
#define BMI160_COMMAND_REG_ADDR                   (0x7E)
#define BMI160_SPI_COMM_TEST_ADDR                 (0x7F)
#define BMI160_INTL_PULLUP_CONF_ADDR              (0x85)

/** Error code definitions */
#define BMI160_OK                                 (0)
#define BMI160_E_NULL_PTR                         (-1)
#define BMI160_E_COM_FAIL                         (-2)
#define BMI160_E_DEV_NOT_FOUND                    (-3)
#define BMI160_E_OUT_OF_RANGE                     (-4)
#define BMI160_E_INVALID_INPUT                    (-5)
#define BMI160_E_ACCEL_ODR_BW_INVALID             (-6)
#define BMI160_E_GYRO_ODR_BW_INVALID              (-7)
#define BMI160_E_LWP_PRE_FLTR_INT_INVALID         (-8)
#define BMI160_E_LWP_PRE_FLTR_INVALID             (-9)
#define BMI160_E_AUX_NOT_FOUND                    (-10)
#define BMI160_E_FOC_FAILURE                      (-11)
#define BMI160_E_READ_WRITE_LENGTH_INVALID        (-12)
#define BMI160_E_INVALID_CONFIG                   (-13)

/**\name API warning codes */
#define BMI160_W_GYRO_SELF_TEST_FAIL              (1)
#define BMI160_W_ACCEl_SELF_TEST_FAIL             (2)

/** BMI160 unique chip identifier */
#define BMI160_CHIP_ID                            (0xD1)

