wojtek327/-49-_stm32_bmi160_spi/stm32_bmi160_defines.h
/** Soft reset command */
#define BMI160_SOFT_RESET_CMD                     (0xb6)
#define BMI160_SOFT_RESET_DELAY_MS                (1)

/** Start FOC command */
#define BMI160_START_FOC_CMD                      (0x03)

/** NVM backup enabling command */
#define BMI160_NVM_BACKUP_EN                      (0xA0)

/* Delay in ms settings */
#define BMI160_ACCEL_DELAY_MS                     (5)
#define BMI160_GYRO_DELAY_MS                      (80)
#define BMI160_ONE_MS_DELAY                       (1)
#define BMI160_AUX_COM_DELAY                      (10)
#define BMI160_GYRO_SELF_TEST_DELAY               (20)
#define BMI160_ACCEL_SELF_TEST_DELAY              (50)

/** Self test configurations */
#define BMI160_ACCEL_SELF_TEST_CONFIG             (0x2C)
#define BMI160_ACCEL_SELF_TEST_POSITIVE_EN        (0x0D)
#define BMI160_ACCEL_SELF_TEST_NEGATIVE_EN        (0x09)
#define BMI160_ACCEL_SELF_TEST_LIMIT              (8192)

/** Power mode settings */
/* Accel power mode */
#define BMI160_ACCEL_NORMAL_MODE                  (0x11)
#define BMI160_ACCEL_LOWPOWER_MODE                (0x12)
#define BMI160_ACCEL_SUSPEND_MODE                 (0x10)

/* Gyro power mode */
#define BMI160_GYRO_SUSPEND_MODE                  (0x14)
#define BMI160_GYRO_NORMAL_MODE                   (0x15)
#define BMI160_GYRO_FASTSTARTUP_MODE              (0x17)

/* Aux power mode */
#define BMI160_AUX_SUSPEND_MODE                   (0x18)
#define BMI160_AUX_NORMAL_MODE                    (0x19)
#define BMI160_AUX_LOWPOWER_MODE                  (0x1A)

/** Bandwidth settings */
/* Accel Bandwidth */
#define BMI160_ACCEL_BW_OSR4_AVG1                 (0x00)
#define BMI160_ACCEL_BW_OSR2_AVG2                 (0x01)
#define BMI160_ACCEL_BW_NORMAL_AVG4               (0x02)
#define BMI160_ACCEL_BW_RES_AVG8                  (0x03)
#define BMI160_ACCEL_BW_RES_AVG16                 (0x04)
#define BMI160_ACCEL_BW_RES_AVG32                 (0x05)
#define BMI160_ACCEL_BW_RES_AVG64                 (0x06)
#define BMI160_ACCEL_BW_RES_AVG128                (0x07)

#define BMI160_GYRO_BW_OSR4_MODE                  (0x00)
#define BMI160_GYRO_BW_OSR2_MODE                  (0x01)
#define BMI160_GYRO_BW_NORMAL_MODE                (0x02)

/* Output Data Rate settings */
/* Accel Output data rate */
#define BMI160_ACCEL_ODR_RESERVED                 (0x00)
#define BMI160_ACCEL_ODR_1_56HZ                   (0x02)
#define BMI160_ACCEL_ODR_3_12HZ                   (0x03)
#define BMI160_ACCEL_ODR_6_25HZ                   (0x04)
#define BMI160_ACCEL_ODR_12_5HZ                   (0x05)
#define BMI160_ACCEL_ODR_25HZ                     (0x06)
#define BMI160_ACCEL_ODR_50HZ                     (0x07)
#define BMI160_ACCEL_ODR_100HZ                    (0x08)
#define BMI160_ACCEL_ODR_200HZ                    (0x09)
#define BMI160_ACCEL_ODR_400HZ                    (0x0A)
#define BMI160_ACCEL_ODR_800HZ                    (0x0B)
#define BMI160_ACCEL_ODR_1600HZ                   (0x0C)
#define BMI160_ACCEL_ODR_RESERVED0                (0x0D)
#define BMI160_ACCEL_ODR_RESERVED1                (0x0E)
#define BMI160_ACCEL_ODR_RESERVED2                (0x0F)

/* Gyro Output data rate */
#define BMI160_GYRO_ODR_RESERVED                  (0x00)
#define BMI160_GYRO_ODR_25HZ                      (0x06)
#define BMI160_GYRO_ODR_50HZ                      (0x07)
#define BMI160_GYRO_ODR_100HZ                     (0x08)
#define BMI160_GYRO_ODR_200HZ                     (0x09)
#define BMI160_GYRO_ODR_400HZ                     (0x0A)
#define BMI160_GYRO_ODR_800HZ                     (0x0B)
#define BMI160_GYRO_ODR_1600HZ                    (0x0C)
#define BMI160_GYRO_ODR_3200HZ                    (0x0D)

/* Auxiliary sensor Output data rate */
#define BMI160_AUX_ODR_RESERVED                   (0x00)
#define BMI160_AUX_ODR_0_78HZ                     (0x01)
#define BMI160_AUX_ODR_1_56HZ                     (0x02)
#define BMI160_AUX_ODR_3_12HZ                     (0x03)
#define BMI160_AUX_ODR_6_25HZ                     (0x04)
#define BMI160_AUX_ODR_12_5HZ                     (0x05)
#define BMI160_AUX_ODR_25HZ                       (0x06)
#define BMI160_AUX_ODR_50HZ                       (0x07)
#define BMI160_AUX_ODR_100HZ                      (0x08)
#define BMI160_AUX_ODR_200HZ                      (0x09)
#define BMI160_AUX_ODR_400HZ                      (0x0A)
#define BMI160_AUX_ODR_800HZ                      (0x0B)

/** FIFO_CONFIG Definitions */
#define BMI160_FIFO_TIME_ENABLE                   (0x02)
#define BMI160_FIFO_TAG_INT2_ENABLE               (0x04)
#define BMI160_FIFO_TAG_INT1_ENABLE               (0x08)
#define BMI160_FIFO_HEAD_ENABLE                   (0x10)
#define BMI160_FIFO_M_ENABLE                      (0x20)
#define BMI160_FIFO_A_ENABLE                      (0x40)
#define BMI160_FIFO_M_A_ENABLE                    (0x60)
#define BMI160_FIFO_G_ENABLE                      (0x80)
#define BMI160_FIFO_M_G_ENABLE                    (0xA0)
#define BMI160_FIFO_G_A_ENABLE                    (0xC0)
#define BMI160_FIFO_M_G_A_ENABLE                  (0xE0)

/* Macro to specify the number of bytes over-read from the
 * FIFO in order to get the sensor time at the end of FIFO */
#ifndef BMI160_FIFO_BYTES_OVERREAD
#define BMI160_FIFO_BYTES_OVERREAD                (25)
#endif

/* Accel, gyro and aux. sensor length and also their combined
 * length definitions in FIFO */
#define BMI160_FIFO_G_LENGTH                      (6)
#define BMI160_FIFO_A_LENGTH                      (6)
#define BMI160_FIFO_M_LENGTH                      (8)
#define BMI160_FIFO_GA_LENGTH                     (12)
#define BMI160_FIFO_MA_LENGTH                     (14)
#define BMI160_FIFO_MG_LENGTH                     (14)
#define BMI160_FIFO_MGA_LENGTH                    (20)

/** FIFO Header Data definitions */
#define BMI160_FIFO_HEAD_SKIP_FRAME               (0x40)
#define BMI160_FIFO_HEAD_SENSOR_TIME              (0x44)
#define BMI160_FIFO_HEAD_INPUT_CONFIG             (0x48)
#define BMI160_FIFO_HEAD_OVER_READ                (0x80)
#define BMI160_FIFO_HEAD_A                        (0x84)
#define BMI160_FIFO_HEAD_G                        (0x88)
#define BMI160_FIFO_HEAD_G_A                      (0x8C)
#define BMI160_FIFO_HEAD_M                        (0x90)
#define BMI160_FIFO_HEAD_M_A                      (0x94)
#define BMI160_FIFO_HEAD_M_G                      (0x98)
#define BMI160_FIFO_HEAD_M_G_A                    (0x9C)

/** FIFO sensor time length definitions */
#define BMI160_SENSOR_TIME_LENGTH                 (3)

