wojtek327/-49-_stm32_bmi160_spi/stm32_bmi160_defines.h
/** FIFO DOWN selection */
/* Accel fifo down-sampling values*/
#define  BMI160_ACCEL_FIFO_DOWN_ZERO              (0x00)
#define  BMI160_ACCEL_FIFO_DOWN_ONE               (0x10)
#define  BMI160_ACCEL_FIFO_DOWN_TWO               (0x20)
#define  BMI160_ACCEL_FIFO_DOWN_THREE             (0x30)
#define  BMI160_ACCEL_FIFO_DOWN_FOUR              (0x40)
#define  BMI160_ACCEL_FIFO_DOWN_FIVE              (0x50)
#define  BMI160_ACCEL_FIFO_DOWN_SIX               (0x60)
#define  BMI160_ACCEL_FIFO_DOWN_SEVEN             (0x70)

/* Gyro fifo down-smapling values*/
#define  BMI160_GYRO_FIFO_DOWN_ZERO               (0x00)
#define  BMI160_GYRO_FIFO_DOWN_ONE                (0x01)
#define  BMI160_GYRO_FIFO_DOWN_TWO                (0x02)
#define  BMI160_GYRO_FIFO_DOWN_THREE              (0x03)
#define  BMI160_GYRO_FIFO_DOWN_FOUR               (0x04)
#define  BMI160_GYRO_FIFO_DOWN_FIVE               (0x05)
#define  BMI160_GYRO_FIFO_DOWN_SIX                (0x06)
#define  BMI160_GYRO_FIFO_DOWN_SEVEN              (0x07)

/* Accel Fifo filter enable*/
#define  BMI160_ACCEL_FIFO_FILT_EN                (0x80)

/* Gyro Fifo filter enable*/
#define  BMI160_GYRO_FIFO_FILT_EN                 (0x08)

/** Definitions to check validity of FIFO frames */
#define FIFO_CONFIG_MSB_CHECK                     (0x80)
#define FIFO_CONFIG_LSB_CHECK                     (0x00)

/*! BMI160 accel FOC configurations */
#define BMI160_FOC_ACCEL_DISABLED                 (0x00)
#define BMI160_FOC_ACCEL_POSITIVE_G               (0x01)
#define BMI160_FOC_ACCEL_NEGATIVE_G               (0x02)
#define BMI160_FOC_ACCEL_0G                       (0x03)

/** Array Parameter DefinItions */
#define BMI160_SENSOR_TIME_LSB_BYTE               (0)
#define BMI160_SENSOR_TIME_XLSB_BYTE              (1)
#define BMI160_SENSOR_TIME_MSB_BYTE               (2)

/** Interface settings */
#define BMI160_SPI_INTF                           (1)
#define BMI160_I2C_INTF                           (0)
#define BMI160_SPI_RD_MASK                        (0x80)
#define BMI160_SPI_WR_MASK                        (0x7F)

/* Sensor & time select definition*/
#define BMI160_ACCEL_SEL                          (0x01)
#define BMI160_GYRO_SEL                           (0x02)
#define BMI160_TIME_SEL                           (0x04)

/* Sensor select mask*/
#define BMI160_SEN_SEL_MASK                       (0x07)

/* Error code mask */
#define BMI160_ERR_REG_MASK                       (0x0F)

/* BMI160 secondary IF address */
#define BMI160_AUX_BMM150_I2C_ADDR                (0x10)

/** BMI160 Length definitions */
#define BMI160_ONE                                (1)
#define BMI160_TWO                                (2)
#define BMI160_THREE                              (3)
#define BMI160_FOUR                               (4)
#define BMI160_FIVE                               (5)

/** BMI160 fifo level Margin */
#define BMI160_FIFO_LEVEL_MARGIN                  (16)

/** BMI160 fifo flush Command */
#define BMI160_FIFO_FLUSH_VALUE                   (0xB0)

/** BMI160 offset values for xyz axes of accel */
#define BMI160_ACCEL_MIN_OFFSET                   (-128)
#define BMI160_ACCEL_MAX_OFFSET                   (127)

/** BMI160 offset values for xyz axes of gyro */
#define BMI160_GYRO_MIN_OFFSET                    (-512)
#define BMI160_GYRO_MAX_OFFSET                    (511)

/** BMI160 fifo full interrupt position and mask */
#define BMI160_FIFO_FULL_INT_POS                  (5)
#define BMI160_FIFO_FULL_INT_MSK                  (0x20)
#define BMI160_FIFO_WTM_INT_POS                   (6)
#define BMI160_FIFO_WTM_INT_MSK                   (0x40)

#define BMI160_FIFO_FULL_INT_PIN1_POS             (5)
#define BMI160_FIFO_FULL_INT_PIN1_MSK             (0x20)
#define BMI160_FIFO_FULL_INT_PIN2_POS             (1)
#define BMI160_FIFO_FULL_INT_PIN2_MSK             (0x02)

#define BMI160_FIFO_WTM_INT_PIN1_POS              (6)
#define BMI160_FIFO_WTM_INT_PIN1_MSK              (0x40)
#define BMI160_FIFO_WTM_INT_PIN2_POS              (2)
#define BMI160_FIFO_WTM_INT_PIN2_MSK              (0x04)

#define BMI160_MANUAL_MODE_EN_POS                 (7)
#define BMI160_MANUAL_MODE_EN_MSK                 (0x80)
#define BMI160_AUX_READ_BURST_POS                 (0)
#define BMI160_AUX_READ_BURST_MSK                 (0x03)

#define BMI160_GYRO_SELF_TEST_POS                 (4)
#define BMI160_GYRO_SELF_TEST_MSK                 (0x10)
#define BMI160_GYRO_SELF_TEST_STATUS_POS          (1)
#define BMI160_GYRO_SELF_TEST_STATUS_MSK          (0x02)

#define BMI160_GYRO_FOC_EN_POS                    (6)
#define BMI160_GYRO_FOC_EN_MSK                    (0x40)

#define BMI160_ACCEL_FOC_X_CONF_POS               (4)
#define BMI160_ACCEL_FOC_X_CONF_MSK               (0x30)

#define BMI160_ACCEL_FOC_Y_CONF_POS               (2)
#define BMI160_ACCEL_FOC_Y_CONF_MSK               (0x0C)

#define BMI160_ACCEL_FOC_Z_CONF_MSK               (0x03)

#define BMI160_FOC_STATUS_POS                     (3)
#define BMI160_FOC_STATUS_MSK                     (0x08)

#define BMI160_GYRO_OFFSET_X_MSK                  (0x03)

#define BMI160_GYRO_OFFSET_Y_POS                  (2)
#define BMI160_GYRO_OFFSET_Y_MSK                  (0x0C)

#define BMI160_GYRO_OFFSET_Z_POS                  (4)
#define BMI160_GYRO_OFFSET_Z_MSK                  (0x30)

#define BMI160_GYRO_OFFSET_EN_POS                 (7)
#define BMI160_GYRO_OFFSET_EN_MSK                 (0x80)

#define BMI160_ACCEL_OFFSET_EN_POS                (6)
#define BMI160_ACCEL_OFFSET_EN_MSK                (0x40)

#define BMI160_GYRO_OFFSET_POS                    (8)
#define BMI160_GYRO_OFFSET_MSK                    (0x0300)

#define BMI160_NVM_UPDATE_POS                     (1)
#define BMI160_NVM_UPDATE_MSK                     (0x02)

#define BMI160_NVM_STATUS_POS                     (4)
#define BMI160_NVM_STATUS_MSK                     (0x10)

#define BMI160_MAG_POWER_MODE_MSK                 (0x03)

#define BMI160_ACCEL_POWER_MODE_MSK               (0x30)
#define BMI160_ACCEL_POWER_MODE_POS               (4)

